dijkstrw/wearlink_nrf58122/main.c
typedef enum
{
    BLE_NO_ADV,               /**< No advertising running. */
    BLE_DIRECTED_ADV,         /**< Direct advertising to the latest central. */
    BLE_FAST_ADV_WHITELIST,   /**< Advertising with whitelist. */
    BLE_FAST_ADV,             /**< Fast advertising running. */
    BLE_SLOW_ADV,             /**< Slow advertising running. */
    BLE_SLEEP,                /**< Go to system-off. */
} ble_advertising_mode_t;

typedef enum
{
    ADC_MODE_KEYPAD,          /* ADC is configured for keypad */
    ADC_MODE_BATTERY,         /* ADC is configured to measure battery */
} adc_mode_t;

static ble_hids_t                        m_hids;                                        /**< Structure used to identify the HID service. */
static ble_bas_t                         m_bas;                                         /**< Structure used to identify the battery service. */

static uint16_t                          m_conn_handle = BLE_CONN_HANDLE_INVALID;       /**< Handle of the current connection. */

APP_TIMER_DEF(m_battery_timer_id);                                                      /**< Battery timer. */

APP_TIMER_DEF(m_adc_timer_id);

static dm_application_instance_t         m_app_handle;                                  /**< Application identifier allocated by device manager. */
static dm_handle_t                       m_bonded_peer_handle;                          /**< Device reference handle to the current bonded central. */

static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, BLE_UUID_TYPE_BLE}};

static adc_mode_t                        adc_mode;
volatile int32_t                         adc_sample;
static uint8_t                           battery_level;
static float                             battery_correction = 1.0;
static uint8_t                           idle_counter = 0;
static uint8_t                           start_key = 0;

/*
  Fibretronics wearlink is a string of push button (no) switches individually
  in series with a resistor. When no button is pressed it is open
  circuit. When one button is pressed, the resistance corresponding to that
  key is present between the two feed wires.

  To determine the value for the adc we calculate ideal adc reading based on
  the known/measured resistance per button.

  Additional wrinkles;
  - ADC reference is VBG = 1.2V
  - ADC prescaling = 1/3
  - ADC input impendance is ~390k
  - ADC sampling time is 20us @ 8 bits, 68us @ 10 bit

  Schematic:

   Vcc--Rk---x----Rl--gnd
             |
            Ra
             |
           Vref/2

   Where:
   Rk = key resistance
   Rl = limit or load resistance, makes a Rk + Rl load when not sampling
   Ra = the adc impedance at sampling time
   Ua = voltage at point x

   Ik = Il + Ia = Vcc / Rk
   Ia = (Ua - (Vref / 2)) / Rain
   Il = Ua / Rl

   Solve for Ua: Ua = (-Vcc - ((Vref / 2) / Ra)) / (-1 - (Rk / Ra) - (Rk / Rl))

  #+ORGTBL: SEND keymarks orgtbl-to-generic :lstart "   { " :lend " }," :sep ", ", :skip 4 :skipcols (3 4 5 6 7)
  | ! | Key                           |       Rk |         Uau |      Ua |   Vscaled |      Adc |   A-D% |    A+D% |
  |   |                               |          |   unsampled | sampled |           |          |        |         |
  |---+-------------------------------+----------+-------------+---------+-----------+----------+--------+---------|
  | # | RELEASE_KEY                   | 10000000 |       0.007 |   0.036 |     0.012 |        3 |      3 |       3 |
  | # | CONSUMER_CTRL_VOL_DW          |    10000 |       2.400 |   2.370 |     0.790 |      169 |    161 |     177 |
  | # | CONSUMER_CTRL_SCAN_PREV_TRACK |    20000 |       1.800 |   1.770 |     0.590 |      126 |    120 |     132 |
  | # | CONSUMER_CTRL_PLAY            |    47000 |       1.075 |   1.058 |     0.353 |       75 |     71 |      79 |
  | # | CONSUMER_CTRL_SCAN_NEXT_TRACK |    30000 |       1.440 |   1.415 |     0.472 |      101 |     96 |     106 |
  | # | CONSUMER_CTRL_VOL_UP          |     5600 |       2.812 |   2.788 |     0.929 |      198 |    188 |     208 |
  |---+-------------------------------+----------+-------------+---------+-----------+----------+--------+---------|
  | $ | Vcc=3.6                       | Rl=20000 | Rain=389200 |         | scale=1/3 | Vref=1.2 | bits=8 | dev=.05 |
  #+TBLFM: $4=($Rl/($Rk+$Rl))*$Vcc;%.3f::$5=(-(($Vref/2)*$3)/$Rain-$Vcc)/((-$3/$Rain)-($3/$Rl)-1);%.3f::$6=$Ua*$scale;%.3f::$7=$Vscaled/($Vref/2^$bits);%.0f::$8=max($7-($dev*$7),0);%.0f::$9=min($7+($dev*$7),2^$bits);%0.f

  Note that the measurement is compared to the internal reference, and that the
  supply voltage will slowly drop due to battery discharge. We take this into
  account by adjusting the adc read voltage by a battery level correction.
*/

#define ADC_BATTERY_3V6  (1<<8)

typedef enum
{
    RELEASE_KEY                     = 0x00,
    CONSUMER_CTRL_PLAY              = 0x01,
    CONSUMER_CTRL_ALCCC             = 0x02,
    CONSUMER_CTRL_SCAN_NEXT_TRACK   = 0x04,
    CONSUMER_CTRL_SCAN_PREV_TRACK   = 0x08,
    CONSUMER_CTRL_VOL_DW            = 0x10,
    CONSUMER_CTRL_VOL_UP            = 0x20,
    CONSUMER_CTRL_AC_FORWARD        = 0x40,
    CONSUMER_CTRL_AC_BACK           = 0x80,
} consumer_control_t;

const struct keymark {
    uint8_t key;
    uint8_t low;
    uint8_t high;
} keymark[KEYPAD_NUMKEYS] = {
/* BEGIN RECEIVE ORGTBL keymarks */
   { CONSUMER_CTRL_VOL_DW,          161, 177 },
   { CONSUMER_CTRL_SCAN_PREV_TRACK, 120, 132 },
   { CONSUMER_CTRL_PLAY,             71,  79 },
   { CONSUMER_CTRL_SCAN_NEXT_TRACK,  96, 106 },
   { CONSUMER_CTRL_VOL_UP,          188, 208 },
/* END RECEIVE ORGTBL keymarks */
};

typedef enum
{
    NO_ACTION,
    ACTION_ERASE_BONDS
} keycombo_action_t;

struct keycombo {
    uint8_t len;
    uint8_t cur;
    keycombo_action_t action;
    uint8_t keys[KEYPAD_COMBINATION_MAXLEN];
} keycombo[KEYPAD_COMBINATIONS] = {
    {7, 0, ACTION_ERASE_BONDS,
     { CONSUMER_CTRL_PLAY,
       CONSUMER_CTRL_PLAY,
       CONSUMER_CTRL_PLAY,
       CONSUMER_CTRL_VOL_DW,
       CONSUMER_CTRL_VOL_DW,
       CONSUMER_CTRL_VOL_UP,
       CONSUMER_CTRL_VOL_UP }},
};

static uint8_t adc_process_battery_measurement(int32_t sample);
static uint8_t adc_process_keypad_measurement(int32_t sample);
static void adc_init(adc_mode_t mode_req);
static void adc_timeout_handler(void *p_context);
static void keypad_combo_handler(uint8_t key);
static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt);

