dijkstrw/wearlink_nrf58122/main.c
    ble_adv_modes_config_t options =
    {
        BLE_ADV_WHITELIST_ENABLED,
        BLE_ADV_DIRECTED_ENABLED,
        BLE_ADV_DIRECTED_SLOW_DISABLED, 0,0,
        BLE_ADV_FAST_ENABLED, APP_ADV_FAST_INTERVAL, APP_ADV_FAST_TIMEOUT,
        BLE_ADV_SLOW_ENABLED, APP_ADV_SLOW_INTERVAL, APP_ADV_SLOW_TIMEOUT
    };

    err_code = ble_advertising_init(&advdata, NULL, &options, on_adv_evt, ble_advertising_error_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the Device Manager events.
 *
 * @param[in]   p_evt   Data associated to the device manager event.
 */
static uint32_t device_manager_evt_handler(dm_handle_t const    * p_handle,
                                           dm_event_t const     * p_event,
                                           ret_code_t           event_result)
{
    APP_ERROR_CHECK(event_result);

    switch(p_event->event_id)
    {
        case DM_EVT_DEVICE_CONTEXT_LOADED: // Fall through.
        case DM_EVT_SECURITY_SETUP_COMPLETE:
            m_bonded_peer_handle = (*p_handle);
            break;
    }

    return NRF_SUCCESS;
}


/**@brief Function for the Device Manager initialization.
 */
static void device_manager_init()
{
    uint32_t               err_code;
    dm_init_param_t        init_param = {.clear_persistent_data = false};
    dm_application_param_t  register_param;

    // Initialize peer device handle.
    err_code = dm_handle_initialize(&m_bonded_peer_handle);
    APP_ERROR_CHECK(err_code);

    // Initialize persistent storage module.
    err_code = pstorage_init();
    APP_ERROR_CHECK(err_code);

    err_code = dm_init(&init_param);
    APP_ERROR_CHECK(err_code);

    memset(&register_param.sec_param, 0, sizeof(ble_gap_sec_params_t));

    register_param.sec_param.bond         = SEC_PARAM_BOND;
    register_param.sec_param.mitm         = SEC_PARAM_MITM;
    register_param.sec_param.io_caps      = SEC_PARAM_IO_CAPABILITIES;
    register_param.sec_param.oob          = SEC_PARAM_OOB;
    register_param.sec_param.min_key_size = SEC_PARAM_MIN_KEY_SIZE;
    register_param.sec_param.max_key_size = SEC_PARAM_MAX_KEY_SIZE;
    register_param.evt_handler            = device_manager_evt_handler;
    register_param.service_type           = DM_PROTOCOL_CNTXT_GATT_SRVR_ID;

    err_code = dm_register(&m_app_handle, &register_param);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing leds.
 */
static void leds_init()
{
    uint32_t err_code = bsp_init(BSP_INIT_LED,
                                 APP_TIMER_TICKS(100, APP_TIMER_PRESCALER),
                                 bsp_event_handler);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the Power manager.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

static void adc_init(adc_mode_t req_mode) {
    nrf_adc_config_t nrf_adc_config = {
        .resolution = NRF_ADC_CONFIG_RES_8BIT,
        .reference = NRF_ADC_CONFIG_REF_VBG
    };

    NVIC_DisableIRQ(ADC_IRQn);
    if (req_mode == ADC_MODE_KEYPAD) {
        nrf_adc_config.scaling = NRF_ADC_CONFIG_SCALING_INPUT_ONE_THIRD;
        nrf_adc_configure((nrf_adc_config_t *)&nrf_adc_config);
        nrf_adc_input_select(KEYPAD_ADC_PIN);
        adc_mode = ADC_MODE_KEYPAD;
    } else {
        nrf_adc_config.scaling = NRF_ADC_CONFIG_SCALING_SUPPLY_ONE_THIRD;
        nrf_adc_configure((nrf_adc_config_t *)&nrf_adc_config);
        nrf_adc_input_select(NRF_ADC_CONFIG_INPUT_DISABLED);
        adc_mode = ADC_MODE_BATTERY;
    }
    adc_sample = -1;
    nrf_adc_int_enable(ADC_INTENSET_END_Enabled << ADC_INTENSET_END_Pos);
    NVIC_SetPriority(ADC_IRQn, NRF_APP_PRIORITY_HIGH);
    NVIC_EnableIRQ(ADC_IRQn);
}

void ADC_IRQHandler(void) {
    nrf_adc_conversion_event_clean();

    adc_sample = nrf_adc_result_get();
}

static void adc_timeout_handler(void *p_context)
{
    uint8_t ble_battery_level;
    uint8_t key;
    uint32_t err_code;

    UNUSED_PARAMETER(p_context);

    app_trace_log("adc %d\r\n", (int)adc_sample);

    if (adc_mode == ADC_MODE_KEYPAD) {
        idle_counter = 0;
        key = adc_process_keypad_measurement(adc_sample);
        if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
            consumer_control_send(key);
        } else {
            keypad_combo_handler(key);
        }
    } else {
        idle_counter++;
        ble_battery_level = adc_process_battery_measurement(adc_sample);

        err_code = ble_bas_battery_level_update(&m_bas, ble_battery_level);
        if ((err_code != NRF_SUCCESS) &&
            (err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != BLE_ERROR_NO_TX_BUFFERS) &&
            (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
            )
        {
            APP_ERROR_HANDLER(err_code);
        }

        adc_init(ADC_MODE_KEYPAD);
    }

    if (idle_counter >= MAX_IDLE_BATTERY_MEAS) {
        app_trace_log("idle for too long -- sleeping\n\r");
        sd_ble_gap_disconnect(m_conn_handle,
                              BLE_HCI_REMOTE_DEV_TERMINATION_DUE_TO_POWER_OFF);
        idle_counter = 0;
        sleep_mode_enter();
    }
}

static uint8_t adc_process_battery_measurement(int32_t sample)
{
    uint8_t ble_battery_level;

    battery_level = sample;
    battery_correction = ((float)ADC_BATTERY_3V6) / battery_level;

    /* Coin cells have a very shallow discharge curve, instead of reporting
     * accurate information we cop out here
     */
    ble_battery_level = ((battery_level * 100)/ADC_BATTERY_3V6);
    app_trace_log("battery level %d%%\r\n", (uint8_t)ble_battery_level);

    return ble_battery_level;
}

static uint8_t adc_process_keypad_measurement(int32_t sample)
{
    uint8_t i;

    adc_sample *= battery_correction;
    app_trace_log("adc corrected for battery level %d\r\n", (int)adc_sample);

    for (i = 0; i < KEYPAD_NUMKEYS; i++) {
        if ((keymark[i].low <= adc_sample) &&
            (keymark[i].high >= adc_sample)) {
            app_trace_log("cc key %d\r\n", keymark[i].key);
            return keymark[i].key;
        }
    }

    return RELEASE_KEY;
}

