dijkstrw/wearlink_nrf58122/main.c
static void keypad_combo_action(keycombo_action_t action)
{
    uint32_t err_code;

    switch (action) {
    case ACTION_ERASE_BONDS:
        err_code = dm_device_delete_all(&m_app_handle);
        APP_ERROR_CHECK(err_code);

        err_code = ble_advertising_restart_without_whitelist();
        if (err_code != NRF_ERROR_INVALID_STATE)
        {
            APP_ERROR_CHECK(err_code);
        }
        break;

    default:
        break;
    }
}

static void keypad_combo_handler(uint8_t key)
{
    uint8_t i;

    if (key == RELEASE_KEY)
        return;

    for (i = 0; i < KEYPAD_COMBINATIONS; i++) {
        if (keycombo[i].keys[keycombo[i].cur] == key) {
            app_trace_log("keycombo %d match %d\n\r", i, keycombo[i].cur);
            keycombo[i].cur++;
            if (keycombo[i].cur == keycombo[i].len) {
                app_trace_log("keycombo %d matched", i);
                keypad_combo_action(keycombo[i].action);
                keycombo[i].cur = 0;
            }
            if (keycombo[i].cur > keycombo[i].len) {
                keycombo[i].cur = 0;
            }
        } else {
            keycombo[i].cur = 0;
        }
    }
}

/*
 * Keypad activity is detected using GPIOTE level changes on a sense pin.
 * This GPIOTE activity is also used to wake from app sleep.
 */
static void keypad_sensed_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    app_trace_log("key change sensed\r\n");
    if (adc_mode == ADC_MODE_KEYPAD) {
        nrf_adc_start();
        app_timer_start(m_adc_timer_id, ADC_MEAS_INTERVAL, NULL);
    }
}

static void keypad_keypress_detection_init(void)
{
    uint32_t err_code;
    nrf_drv_gpiote_in_config_t config = GPIOTE_CONFIG_IN_SENSE_TOGGLE(false);

    err_code = nrf_drv_gpiote_init();
    APP_ERROR_CHECK(err_code);
    err_code = nrf_drv_gpiote_in_init(KEYPAD_SENSE_PIN, &config, keypad_sensed_handler);
    APP_ERROR_CHECK(err_code);
    nrf_drv_gpiote_in_event_enable(KEYPAD_SENSE_PIN, false);
}

/*
 * At boot read adc for keypresses that indicate special application events.
 */
static void keypad_boot_buttons(void)
{
    adc_init(ADC_MODE_BATTERY);
    nrf_adc_start();
    while (adc_sample == -1);
    adc_process_battery_measurement(adc_sample);

    adc_init(ADC_MODE_KEYPAD);
    nrf_adc_start();
    while (adc_sample == -1);
    start_key = adc_process_keypad_measurement(adc_sample);
    app_trace_log("startup key %d\n\r", key);
}

/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;

    // Initialize.
    app_trace_init();
    keypad_boot_buttons();

    timers_init();
    leds_init();

    keypad_keypress_detection_init();

    ble_stack_init();
    scheduler_init();
    device_manager_init();
    gap_params_init();
    advertising_init();
    services_init();
    conn_params_init();

    // Start execution.
    timers_start();
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    // Enter main loop.
    for (;;)
    {
        app_sched_execute();
        power_manage();
    }
}

/**
 * @}
 */
